cases/passiveTransGDHFoam/pitzDaily/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
24170
(
3.09504e-06
3.88547e-08
3.02562e-06
6.94144e-08
2.96784e-06
5.77831e-08
2.91027e-06
5.75758e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
-3.13389e-06
-3.45644e-06
-3.81219e-06
-4.20456e-06
-4.63731e-06
-5.1146e-06
-5.64101e-06
-4.40611e-06
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
3.25619e-06
3.43337e-06
3.49327e-06
3.5349e-06
3.57156e-06
3.60634e-06
3.64056e-06
3.67495e-06
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
